## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                  RESOURCE                  |
|--------|--------------------------------------------|
| add    | `aws_wafv2_rule_group.rate_limiters_group` |
|        | `aws_wafv2_web_acl.superset`               |
|        | `aws_wafv2_web_acl_association.superset`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_wafv2_rule_group.rate_limiters_group will be created
  + resource "aws_wafv2_rule_group" "rate_limiters_group" {
      + arn         = (known after apply)
      + capacity    = 32
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "RateLimitersGroup"
      + name_prefix = (known after apply)
      + scope       = "REGIONAL"
      + tags        = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }

      + rule {
          + name     = "BlanketRequestLimit"
          + priority = 1

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 1000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "BlanketRequestLimit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "PostRequestLimit"
          + priority = 2

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 100

                  + scope_down_statement {
                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "post"

                          + field_to_match {
                              + method {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "PostRequestRateLimit"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "RateLimitersGroup"
          + sampled_requests_enabled   = false
        }
    }

  # aws_wafv2_web_acl.superset will be created
  + resource "aws_wafv2_web_acl" "superset" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "superset_lb"
      + scope                       = "REGIONAL"
      + tags                        = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "InvalidHost"
          + priority = 1

          + action {
              + block {
                }
            }

          + statement {
              + not_statement {
                  + statement {
                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "superset.cdssandbox.xyz"

                          + field_to_match {
                              + single_header {
                                  + name = "host"
                                }
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 2
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "InvalidHost"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 50

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 30

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 40

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "RateLimitersRuleGroup"
          + priority = 20

          + override_action {
              + none {}
            }

          + statement {
              + rule_group_reference_statement {
                  + arn = (known after apply)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "rate_limiters_rule_group"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "superset"
          + sampled_requests_enabled   = true
        }
    }

  # aws_wafv2_web_acl_association.superset will be created
  + resource "aws_wafv2_web_acl_association" "superset" {
      + id           = (known after apply)
      + resource_arn = "arn:aws:elasticloadbalancing:ca-central-1:066023111852:loadbalancer/app/superset-prod/d9046c2b02959d94"
      + web_acl_arn  = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.notify_data_export.aws_s3_bucket.this,
  on .terraform/modules/notify_data_export/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.cur_data_extract"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.notify"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.data_export"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_s3_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.data_export"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.data_export"]

31 tests, 19 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
